app/views/home/index.html.erb

	<div class="product_box">
		<%= link_to image_tag(image_category.images.first.image_url, :class => 'list_image'),:controller => "images", :action=>"index",:id=> image_category.id %>
		<h3><%= image_category.title%></h3>
		<p class="product_price"><%= image_category.images.count%></p>
---
SELECT `images`.* FROM `images` WHERE `images`.`image_category_id` = 1 LIMIT 1
SELECT COUNT(*) FROM `images` WHERE `images`.`image_category_id` = 1