app/controllers/home_controller.rb

  def index
    @image_categories = ImageCategory.all
---
SELECT `image_categories`.* FROM `image_categories`