app/controllers/images_controller.rb

  def index
    if params[:id]
      @images = Image.where("image_category_id=?", params[:id])
    else
      @images = Image.all :limit=>9
---
SELECT `images`.* FROM `images` WHERE (image_category_id='1') LIMIT 1
SELECT `images`.* FROM `images` LIMIT 9

  def show
    @image = Image.find(params[:id])
---
SELECT `images`.* FROM `images` WHERE `images`.`id` = 1 LIMIT 1