app/controllers/images_controller.rb

  def index
    if params[:id]
      @images = Image.where("image_category_id=?", params[:id])
    end
    if @images==nil or @images.size==0
---
SELECT COUNT(*) FROM `images` WHERE (image_category_id='11')