app/controllers/image_categories_controller.rb

SELECT `image_categories`.* FROM `image_categories`
---
  def index
    @image_categories = ImageCategory.all

SELECT `image_categories`.* FROM `image_categories` WHERE `image_categories`.`id` = 1 LIMIT 1
---
  def show
    @image_category = ImageCategory.find(params[:id])

SELECT `image_categories`.* FROM `image_categories` WHERE `image_categories`.`id` = 1 LIMIT 1
---
  def edit
    @image_category = ImageCategory.find(params[:id])

INSERT INTO `image_categories` (`created_at`, `description`, `title`, `updated_at`) VALUES ('2012-09-24 18:55:44', 'Funny Animals', 'Funny Animals', '2012-09-24 18:55:44')
---
  def create
    @image_category = ImageCategory.new(params[:image_category])

    respond_to do |format|
      if @image_category.save