app/views/images/index.html.erb

<h3 style="width: 71%;border: 1px solid;background: #4C4A4A; margin-bottom:2px"><%=@images.first.image_category.title%></h3>
---
SELECT `image_categories`.* FROM `image_categories`
SELECT `images`.* FROM `images` WHERE (image_category_id='1') LIMIT 1